src/cf/Логистика/src/Documents/ПриходныйОрдер/ПриходныйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйОрдер</name>
  <registerRecords>AccumulationRegister.ТоварыКПоступлениюНаСклад</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/Логистика/src/AccumulationRegisters/ТоварыКПоступлениюНаСклад/ТоварыКПоступлениюНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКПоступлениюНаСклад</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Оприходование</types>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.ПриходныйОрдер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/Логистика/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/Логистика/src/InformationRegisters/СтатусыСкладскихДокументов/СтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыСкладскихДокументов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСкладскихДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.Списание</types>
      <types>DocumentRef.Оприходование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/Логистика/src/Enums/НазначениеУзлаОбмена/НазначениеУзлаОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначениеУзлаОбмена</name>
  <enumValues>
    <name>Справочники</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
</mdclass:Enum>

src/cf/Логистика/src/Documents/ПриходныйОрдер/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		Ответственный = Пользователи.ТекущийПользователь();
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Оприходование") Тогда
		ДокументОснование = ДанныеЗаполнения;
		ДокументОснованиеПредставление = Строка(ДанныеЗаполнения);
		Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Склад");
		ЗаполнитьПоОстаткамТоварыКПоступлениюНаСклад(ДанныеЗаполнения); 
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Перемещение") Тогда
		ДокументОснование = ДанныеЗаполнения;
		ДокументОснованиеПредставление = Строка(ДанныеЗаполнения);
		Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "СкладПоступления");
		ЗаполнитьПоОстаткамТоварыКПоступлениюНаСклад(ДанныеЗаполнения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыКПоступлениюНаСклад.Записывать = Истина;
	Движения.ТоварыНаСкладах.Записывать = Истина;

	СтруктураУзлаОбмена = ЛогистикаСинхронизацияСервер.ПолучитьУзелОбмена(Перечисления.НазначениеУзлаОбмена.Документы);
	
	СтруктураТаблиц = Документы.ПриходныйОрдер.ПолучитьТаблицыДвижений(Ссылка, СтруктураУзлаОбмена.ЦентральныйОфис);
	
	Движения.ТоварыКПоступлениюНаСклад.Загрузить(СтруктураТаблиц.ТаблицаТоварыКПоступлениюНаСклад);
	Движения.ТоварыНаСкладах.Загрузить(СтруктураТаблиц.ТаблицаТоварыНаСкладах);

	РегистрыСведений.СтатусыСкладскихДокументов.ОпределитьСтатусДокумента(ДокументОснование);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьПоОстаткамТоварыКПоступлениюНаСклад(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюНаСклад.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюНаСклад.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлениюНаСклад.Остатки(, Документ = &Документ
	|	И Склад = &Склад) КАК ТоварыКПоступлениюНаСклад
	|ГДЕ
	|	ТоварыКПоступлениюНаСклад.КоличествоОстаток > 0";	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Склад", Склад);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
